name: "sum"
layers {
	bottom: "input_arr_1"
	bottom: "input_arr_2"
	top: "output_arr"
	name: "eltwise1"
	type: ELTWISE
	eltwise_param{operation:MAX}
}
input: "input_arr_1"
input: "input_arr_2"
input_dim: 2
input_dim: 1
input_dim: 1
input_dim: 1
input_dim: 2
input_dim: 1
input_dim: 1
input_dim: 1
